In [2]:
import pandas as pd 
import numpy as np

In [5]:
emp = pd.read_excel('/Users/sotala/Desktop/AVSCODE/O.TEST/28_EDA/Rawdata.xlsx')

In [7]:
emp.shape

(6, 6)

In [8]:
emp.head(10)

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [10]:
emp.isnull().sum()

Name        0
Domain      0
Age         2
Location    2
Salary      0
Exp         1
dtype: int64

In [ ]:
emp